---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSettings
source: html/1d1b89be-c2ae-ca39-01ce-f5b01178fb1e.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings

Provides access to project-wide structural settings.

## Syntax (C#)
```csharp
public class StructuralSettings : Element
```